manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
#include "../../include/ble/meshtastic_ble.h"

#include "ble/ble_uuids.h"
#include "ble/meshtastic_ble_observer_bridge.h"
#include "ble/meshtastic_ble_persistence_bridge.h"
#include "chat/ble/meshtastic_defaults.h"
#include "chat/ble/meshtastic_phone_config_bridge.h"
#include "platform/nrf52/arduino_common/chat/infra/meshtastic/meshtastic_radio_adapter.h"
#include "platform/shared/ble/app_config_phone_snapshot_bridge.h"
#include "platform/shared/ble/meshtastic_phone_runtime_bridge.h"

#include <Adafruit_LittleFS.h>
#include <Arduino.h>
#include <InternalFileSystem.h>
#include <cstdarg>
#include <cstdio>
#include <cstring>
#include <nrf_soc.h>

extern "C" bool trailmate_nrf52_debug_check_gps_guard(const char* tag) __attribute__((weak));

namespace ble
{
namespace
{
constexpr uint32_t kDefaultBleFixedPin = 654321;
constexpr uint32_t kConfigSaveDebounceMs = 1500UL;
constexpr uint32_t kBleIdleStateLogIntervalMs = 10000UL;
constexpr uint32_t kBleConnectedSessionLogIntervalMs = 30000UL;
constexpr uint32_t kDirectedAdvertisingMs = 3000UL;
constexpr uint16_t kBleAdvertisingFastInterval = 32;
constexpr uint16_t kBleAdvertisingSlowInterval = 668;
constexpr uint16_t kBleAdvertisingFastTimeoutSec = 30;
constexpr uint32_t kPhoneSessionStaleMs = 90000UL;
constexpr uint32_t kPhoneSessionStaleLogIntervalMs = 30000UL;
constexpr uint8_t kFromRadioEmptyInactive = 1;
constexpr uint8_t kFromRadioEmptyNoFrame = 2;
constexpr uint8_t kFromRadioEmptyInvalidFrame = 3;
constexpr uint8_t kSteadyPublishedFromRadioWindow = 1;
constexpr uint32_t kFromRadioReadHoldMs = 250UL;
constexpr uint32_t kUnsetAgeMs = 0xFFFFFFFFUL;

bool usbSerialWritable(std::size_t len)
{
    return static_cast<bool>(Serial) && Serial.dtr() != 0 && Serial.availableForWrite() >= static_cast<int>(len);
}

void bleLogBoth(const char* fmt, ...)
{
    char buffer[192] = {};
    va_list args;
    va_start(args, fmt);
    std::vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);
    if (usbSerialWritable(std::strlen(buffer) + 2U))
    {
        Serial.println(buffer);
    }
    Serial2.println(buffer);
}

void probeGpsGuard(const char* tag)
{
    if (trailmate_nrf52_debug_check_gps_guard)
    {
        (void)trailmate_nrf52_debug_check_gps_guard(tag);
    }
}

const char* bleFrameKindName(phone::meshtastic::MeshtasticBleFrameKind kind)
{
    using phone::meshtastic::MeshtasticBleFrameKind;
    switch (kind)
    {
    case MeshtasticBleFrameKind::Config:
        return "config";
    case MeshtasticBleFrameKind::Liveness:
        return "liveness";
    case MeshtasticBleFrameKind::QueueStatus:
        return "queue_status";
    case MeshtasticBleFrameKind::AdminResponse:
        return "admin_response";
    case MeshtasticBleFrameKind::NodeInfo:
        return "node_info";
    case MeshtasticBleFrameKind::Packet:
        return "packet";
    case MeshtasticBleFrameKind::MqttProxy:
        return "mqtt_proxy";
    case MeshtasticBleFrameKind::None:
    default:
        return "none";
    }
}

uint32_t parsePasskeyDigits(const uint8_t passkey[6])
{
    if (!passkey)
    {
        return 0;
    }

    char digits[7] = {};
    for (size_t i = 0; i < 6; ++i)
    {
        const uint8_t ch = passkey[i];
        if (ch < '0' || ch > '9')
        {
            return 0;
        }
        digits[i] = static_cast<char>(ch);
    }
    return static_cast<uint32_t>(std::strtoul(digits, nullptr, 10));
}

uint32_t generateBlePairingPasskey()
{
    uint32_t entropy = 0;
    uint8_t available = 0;
    if (sd_rand_application_bytes_available_get(&available) == NRF_SUCCESS && available >= sizeof(entropy) &&
        sd_rand_application_vector_get(reinterpret_cast<uint8_t*>(&entropy), sizeof(entropy)) == NRF_SUCCESS)
    {
        return (entropy % 900000UL) + 100000UL;
    }

    entropy = static_cast<uint32_t>(random(0, 0x7FFFFFFF)) ^ (static_cast<uint32_t>(millis()) << 16U) ^
              static_cast<uint32_t>(micros());
    return (entropy % 900000UL) + 100000UL;
}

void formatBlePasskey(uint32_t passkey, char out[7])
{
    std::snprintf(out, 7, "%06lu", static_cast<unsigned long>(passkey % 1000000UL));
}

bool clearSoftDeviceBlePasskey()
{
    ble_opt_t opt{};
    opt.gap_opt.passkey.p_passkey = nullptr;
    return sd_ble_opt_set(BLE_GAP_OPT_PASSKEY, &opt) == NRF_SUCCESS;
}

const char* gapSecurityStatusName(uint8_t status)
{
    switch (status)
    {
    case BLE_GAP_SEC_STATUS_SUCCESS:
        return "success";
    case BLE_GAP_SEC_STATUS_TIMEOUT:
        return "timeout";
    case BLE_GAP_SEC_STATUS_PASSKEY_ENTRY_FAILED:
        return "passkey_entry_failed";
    case BLE_GAP_SEC_STATUS_OOB_NOT_AVAILABLE:
        return "oob_not_available";
    case BLE_GAP_SEC_STATUS_AUTH_REQ:
        return "auth_req";
    case BLE_GAP_SEC_STATUS_CONFIRM_VALUE:
        return "confirm_value";
    case BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP:
        return "pairing_not_supported";
    case BLE_GAP_SEC_STATUS_ENC_KEY_SIZE:
        return "enc_key_size";
    case BLE_GAP_SEC_STATUS_SMP_CMD_UNSUPPORTED:
        return "smp_cmd_unsupported";
    case BLE_GAP_SEC_STATUS_UNSPECIFIED:
        return "unspecified";
    case BLE_GAP_SEC_STATUS_REPEATED_ATTEMPTS:
        return "repeated_attempts";
    case BLE_GAP_SEC_STATUS_INVALID_PARAMS:
        return "invalid_params";
    case BLE_GAP_SEC_STATUS_DHKEY_FAILURE:
        return "dhkey_failure";
    default:
        return "unknown";
    }
}

const char* bleAddressTypeName(uint8_t type)
{
    switch (type)
    {
    case BLE_GAP_ADDR_TYPE_PUBLIC:
        return "public";
    case BLE_GAP_ADDR_TYPE_RANDOM_STATIC:
        return "random_static";
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE:
        return "private_resolvable";
    case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
        return "private_non_resolvable";
    default:
        return "unknown";
    }
}

void formatBleAddress(const ble_gap_addr_t& addr, char* out, size_t out_len)
{
    if (!out || out_len == 0)
    {
        return;
    }
    std::snprintf(out,
                  out_len,
                  "%02X:%02X:%02X:%02X:%02X:%02X",
                  addr.addr[5],
                  addr.addr[4],
                  addr.addr[3],
                  addr.addr[2],
                  addr.addr[1],
                  addr.addr[0]);
}

bool isEmptyBleAddress(const ble_gap_addr_t& addr)
{
    for (uint8_t byte : addr.addr)
    {
        if (byte != 0)
        {
            return false;
        }
    }
    return true;
}

