manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
bool isIdentityBleAddressType(uint8_t type)
{
    return type == BLE_GAP_ADDR_TYPE_PUBLIC || type == BLE_GAP_ADDR_TYPE_RANDOM_STATIC;
}

uint32_t ageSinceOrUnset(uint32_t now_ms, uint32_t then_ms)
{
    return then_ms == 0 ? kUnsetAgeMs : now_ms - then_ms;
}

bool readProtoVarint(const uint8_t* data, size_t len, size_t* index, uint64_t* out)
{
    if (!data || !index || !out)
    {
        return false;
    }

    uint64_t value = 0;
    uint8_t shift = 0;
    while (*index < len && shift < 64)
    {
        const uint8_t byte = data[*index];
        ++(*index);
        value |= static_cast<uint64_t>(byte & 0x7FU) << shift;
        if ((byte & 0x80U) == 0)
        {
            *out = value;
            return true;
        }
        shift = static_cast<uint8_t>(shift + 7U);
    }
    return false;
}

uint32_t peekToRadioVariant(const uint8_t* data, size_t len)
{
    size_t index = 0;
    while (index < len)
    {
        uint64_t key = 0;
        if (!readProtoVarint(data, len, &index, &key))
        {
            return 0;
        }
        const uint32_t field = static_cast<uint32_t>(key >> 3U);
        const uint8_t wire_type = static_cast<uint8_t>(key & 0x07U);
        if (field == meshtastic_ToRadio_packet_tag || field == meshtastic_ToRadio_want_config_id_tag ||
            field == meshtastic_ToRadio_disconnect_tag || field == meshtastic_ToRadio_xmodemPacket_tag ||
            field == meshtastic_ToRadio_mqttClientProxyMessage_tag || field == meshtastic_ToRadio_heartbeat_tag)
        {
            return field;
        }

        uint64_t skip_len = 0;
        switch (wire_type)
        {
        case 0:
            if (!readProtoVarint(data, len, &index, &skip_len))
            {
                return 0;
            }
            break;
        case 1:
            if (len - index < 8)
            {
                return 0;
            }
            index += 8;
            break;
        case 2:
            if (!readProtoVarint(data, len, &index, &skip_len) || skip_len > len - index)
            {
                return 0;
            }
            index += static_cast<size_t>(skip_len);
            break;
        case 5:
            if (len - index < 4)
            {
                return 0;
            }
            index += 4;
            break;
        default:
            return 0;
        }
    }
    return 0;
}

bool blePairingRequiresSecurity(const meshtastic_Config_BluetoothConfig& config)
{
    return config.mode != meshtastic_Config_BluetoothConfig_PairingMode_NO_PIN;
}

SecureMode_t bleCharacteristicSecurityMode(const meshtastic_Config_BluetoothConfig& config)
{
    return blePairingRequiresSecurity(config) ? SECMODE_ENC_NO_MITM : SECMODE_OPEN;
}

SecureMode_t bleServiceSecurityMode(const meshtastic_Config_BluetoothConfig& config)
{
    return blePairingRequiresSecurity(config) ? SECMODE_ENC_WITH_MITM : SECMODE_OPEN;
}

bool loadFirstPeripheralBondPeer(ble_gap_addr_t* out)
{
    if (!out)
    {
        return false;
    }

    namespace lfs = Adafruit_LittleFS_Namespace;
    lfs::File dir(BOND_DIR_PRPH, lfs::FILE_O_READ, InternalFS);
    if (!dir)
    {
        return false;
    }

    lfs::File file(InternalFS);
    while ((file = dir.openNextFile(lfs::FILE_O_READ)))
    {
        if (file.isDirectory())
        {
            file.close();
            continue;
        }

        const int key_len = file.read();
        if (key_len == static_cast<int>(sizeof(bond_keys_t)))
        {
            bond_keys_t keys{};
            const int read_len = file.read(reinterpret_cast<uint8_t*>(&keys), sizeof(keys));
            const ble_gap_addr_t peer = keys.peer_id.id_addr_info;
            if (read_len == static_cast<int>(sizeof(keys)) && isIdentityBleAddressType(peer.addr_type) &&
                !isEmptyBleAddress(peer))
            {
                *out = peer;
                char peer_addr_text[24] = {};
                formatBleAddress(peer, peer_addr_text, sizeof(peer_addr_text));
                bleLogBoth("[BLE][nrf52][mt] bond peer recovered file=%s peer=%s type=%s(0x%02X)",
                           file.name(),
                           peer_addr_text,
                           bleAddressTypeName(peer.addr_type),
                           static_cast<unsigned>(peer.addr_type));
                file.close();
                dir.close();
                return true;
            }
        }

        file.close();
    }

    dir.close();
    return false;
}

const char* disconnectReasonName(uint8_t reason)
{
    switch (reason)
    {
    case BLE_HCI_STATUS_CODE_SUCCESS:
        return "success";
    case BLE_HCI_STATUS_CODE_UNKNOWN_CONNECTION_IDENTIFIER:
        return "unknown_connection";
    case BLE_HCI_AUTHENTICATION_FAILURE:
        return "auth_failure";
    case BLE_HCI_STATUS_CODE_PIN_OR_KEY_MISSING:
        return "pin_or_key_missing";
    case BLE_HCI_CONNECTION_TIMEOUT:
        return "connection_timeout";
    case BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION:
        return "remote_user";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_LOW_RESOURCES:
        return "remote_low_resources";
    case BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_POWER_OFF:
        return "remote_power_off";
    case BLE_HCI_LOCAL_HOST_TERMINATED_CONNECTION:
        return "local_host";
    case BLE_HCI_CONN_INTERVAL_UNACCEPTABLE:
        return "interval_unacceptable";
    case BLE_HCI_CONN_TERMINATED_DUE_TO_MIC_FAILURE:
        return "mic_failure";
    case BLE_HCI_CONN_FAILED_TO_BE_ESTABLISHED:
        return "failed_to_establish";
    default:
        return "unknown";
    }
}

const char* fromRadioEmptyReasonName(uint8_t reason)
{
    switch (reason)
    {
    case kFromRadioEmptyInactive:
        return "inactive";
    case kFromRadioEmptyNoFrame:
        return "no_frame";
    case kFromRadioEmptyInvalidFrame:
        return "invalid_frame";
    default:
        return "unknown";
    }
}

MeshtasticBleService* s_active_service = nullptr;

void onBleConnect(uint16_t conn_handle)
{
    if (s_active_service)
    {
        s_active_service->handleConnectEvent(conn_handle);
    }
}

