manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
void onBleDisconnect(uint16_t conn_handle, uint8_t reason)
{
    if (!s_active_service)
    {
        return;
    }
    s_active_service->handleDisconnectEvent(conn_handle, reason);
}

bool onPairPasskeyDisplay(uint16_t conn_handle, uint8_t const passkey[6], bool match_request)
{
    if (s_active_service)
    {
        s_active_service->handlePairPasskeyDisplay(conn_handle, passkey, match_request);
    }
    return true;
}

void onPairComplete(uint16_t conn_handle, uint8_t auth_status)
{
    if (s_active_service)
    {
        s_active_service->handlePairComplete(conn_handle, auth_status);
    }
}

void onSecured(uint16_t conn_handle)
{
    if (s_active_service)
    {
        s_active_service->handleSecured(conn_handle);
    }
}

void prepareBluefruit(const std::string& device_name)
{
    bleLogBoth("[BLE][nrf52][mt] bluefruit begin name=%s", device_name.c_str());
    Bluefruit.autoConnLed(false);
    Bluefruit.configPrphBandwidth(BANDWIDTH_MAX);
    Bluefruit.begin(1, 0);
    Bluefruit.setTxPower(4);
    Bluefruit.setName(device_name.c_str());
    Bluefruit.Periph.setConnectCallback(onBleConnect);
    Bluefruit.Periph.setDisconnectCallback(onBleDisconnect);
    Bluefruit.Periph.setConnSlaveLatency(0);
    Bluefruit.Periph.setConnInterval(12, 80);
    const ble_gap_addr_t own_addr = Bluefruit.getAddr();
    char own_addr_text[24] = {};
    formatBleAddress(own_addr, own_addr_text, sizeof(own_addr_text));
    bleLogBoth("[BLE][nrf52][mt] bluefruit ready own=%s type=%s(0x%02X) tx_power=%d conn_interval=12..80 "
               "latency=0 name=%s",
               own_addr_text,
               bleAddressTypeName(own_addr.addr_type),
               static_cast<unsigned>(own_addr.addr_type),
               static_cast<int>(Bluefruit.getTxPower()),
               device_name.c_str());
}

bool startAdvertising(::BLEService& service, const ble_gap_addr_t* directed_peer)
{
    const bool directed = directed_peer && isIdentityBleAddressType(directed_peer->addr_type) &&
                          !isEmptyBleAddress(*directed_peer);
    char peer_addr_text[24] = {};
    if (directed)
    {
        formatBleAddress(*directed_peer, peer_addr_text, sizeof(peer_addr_text));
    }

    Bluefruit.Advertising.stop();
    Bluefruit.Advertising.clearData();
    Bluefruit.ScanResponse.clearData();
    Bluefruit.Advertising.setInterval(kBleAdvertisingFastInterval, kBleAdvertisingSlowInterval);
    Bluefruit.Advertising.setFastTimeout(kBleAdvertisingFastTimeoutSec);
    if (directed)
    {
        Bluefruit.Advertising.setType(BLE_GAP_ADV_TYPE_CONNECTABLE_NONSCANNABLE_DIRECTED);
        Bluefruit.Advertising.setPeerAddress(*directed_peer);
        Bluefruit.Advertising.restartOnDisconnect(false);
        const bool ok = Bluefruit.Advertising.start(kDirectedAdvertisingMs / 1000UL);
        bleLogBoth("[BLE][nrf52][mt] advertising mode=directed peer=%s type=%s(0x%02X) running=%u ok=%u window_ms=%lu",
                   peer_addr_text,
                   bleAddressTypeName(directed_peer->addr_type),
                   static_cast<unsigned>(directed_peer->addr_type),
                   Bluefruit.Advertising.isRunning() ? 1U : 0U,
                   ok ? 1U : 0U,
                   static_cast<unsigned long>(kDirectedAdvertisingMs));
        return ok;
    }

    Bluefruit.Advertising.setType(BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED);
    const bool flags_ok = Bluefruit.Advertising.addFlags(BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE);
    const bool service_ok = Bluefruit.Advertising.addService(service);
    const bool tx_power_ok = Bluefruit.ScanResponse.addTxPower();
    const bool name_ok = Bluefruit.ScanResponse.addName();
    Bluefruit.Advertising.restartOnDisconnect(true);
    const bool ok = Bluefruit.Advertising.start(0);
    bleLogBoth("[BLE][nrf52][mt] advertising mode=undirected running=%u ok=%u restart=1 interval=%u..%u "
               "fast_timeout_s=%u adv_len=%u scan_len=%u flags=%u service=%u scan_tx_power=%u scan_name=%u",
               Bluefruit.Advertising.isRunning() ? 1U : 0U,
               ok ? 1U : 0U,
               static_cast<unsigned>(kBleAdvertisingFastInterval),
               static_cast<unsigned>(kBleAdvertisingSlowInterval),
               static_cast<unsigned>(kBleAdvertisingFastTimeoutSec),
               static_cast<unsigned>(Bluefruit.Advertising.count()),
               static_cast<unsigned>(Bluefruit.ScanResponse.count()),
               flags_ok ? 1U : 0U,
               service_ok ? 1U : 0U,
               tx_power_ok ? 1U : 0U,
               name_ok ? 1U : 0U);
    return ok;
}

void disconnectAll()
{
    for (uint8_t index = 0; index < BLE_MAX_CONNECTION; ++index)
    {
        if (Bluefruit.connected(index))
        {
            Bluefruit.disconnect(index);
        }
    }
}

void authorizeRead(uint16_t conn_handle)
{
    ble_gatts_rw_authorize_reply_params_t reply = {.type = BLE_GATTS_AUTHORIZE_TYPE_READ};
    reply.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
    sd_ble_gatts_rw_authorize_reply(conn_handle, &reply);
}

void onToRadioWrite(uint16_t, BLECharacteristic*, uint8_t* data, uint16_t len)
{
    if (!s_active_service || !data || len == 0)
    {
        return;
    }
    (void)s_active_service->enqueueToRadio(data, len);
}

void onFromNumCccdWrite(uint16_t conn_handle, BLECharacteristic*, uint16_t value)
{
    if (s_active_service)
    {
        s_active_service->handleFromNumCccdWrite(conn_handle, value);
    }
}

void onFromRadioAuthorize(uint16_t conn_handle, BLECharacteristic* chr, ble_gatts_evt_read_t* request)
{
    if (!chr || !request)
    {
        authorizeRead(conn_handle);
        return;
    }

    if (request->offset != 0)
    {
        authorizeRead(conn_handle);
        return;
    }

    if (s_active_service)
    {
        s_active_service->handleFromRadioReadRequest(
            conn_handle, request->offset, reinterpret_cast<uintptr_t>(chr));
        return;
    }

    authorizeRead(conn_handle);
}

} // namespace

MeshtasticBleService::MeshtasticBleService(app::IAppBleFacade& ctx, const std::string& device_name)
    : phone_facade_(ctx, ble_config_, module_config_, this),
      observer_bridge_(new MeshtasticBleObserverBridge(ctx, *this)),
      device_name_(device_name),
      service_(::BLEUuid(MESH_SERVICE_UUID_128_LE)),
      to_radio_(::BLEUuid(TORADIO_UUID_128_LE)),
      from_radio_(::BLEUuid(FROMRADIO_UUID_128_LE)),
      from_num_(::BLEUuid(FROMNUM_UUID_128_LE)),
      log_radio_(::BLEUuid(LOGRADIO_UUID_128_LE))
{
    ble_config_ = meshtastic_Config_BluetoothConfig_init_zero;
    ble_config_.enabled = phone_facade_.isBleEnabled();
    ble_config_.mode = meshtastic_Config_BluetoothConfig_PairingMode_RANDOM_PIN;
    ble_config_.fixed_pin = 0;

    meshtastic_config_bridge::PersistedState persisted{};
    const bool persisted_ok = loadMeshtasticBlePersistedState(&persisted);

    bleLogBoth("[BLE][nrf52][mt] persisted load ok=%u has_bt=%u has_mod=%u",
               persisted_ok ? 1U : 0U,
               persisted.has_bluetooth ? 1U : 0U,
               persisted.has_module ? 1U : 0U);

    logMeshtasticBlePersistenceStatus();

    meshtastic_config_bridge::initializeConfigState(
        persisted, phone_facade_.isBleEnabled(), phone_facade_.getSelfNodeId(), &ble_config_, &module_config_);

    if (persisted.has_bluetooth)
    {
        bleLogBoth("[BLE][nrf52][mt] loaded bluetooth cfg mode=%u pin=%06lu",
                   static_cast<unsigned>(ble_config_.mode),
                   static_cast<unsigned long>(ble_config_.fixed_pin));
    }
    if (persisted.has_module)
    {
        bleLogBoth("[BLE][nrf52][mt] loaded module cfg mqtt enabled=%u proxy=%u root=%s",
                   module_config_.has_mqtt && module_config_.mqtt.enabled ? 1U : 0U,
                   module_config_.has_mqtt && module_config_.mqtt.proxy_to_client_enabled ? 1U : 0U,
                   module_config_.mqtt.root);
    }

