manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
    prepareBluefruit(device_name_);
    loadRememberedPhonePeer();
    applyBleSecurity();

    const SecureMode_t service_sec_mode = bleServiceSecurityMode(ble_config_);
    const SecureMode_t char_sec_mode = bleCharacteristicSecurityMode(ble_config_);
    service_.setPermission(service_sec_mode, service_sec_mode);
    service_.begin();
    bleLogBoth("[BLE][nrf52][mt] service begin sec_mode=0x%02X char_sec_mode=0x%02X",
               static_cast<unsigned>(service_sec_mode),
               static_cast<unsigned>(char_sec_mode));

    to_radio_.setProperties(CHR_PROPS_WRITE);
    to_radio_.setPermission(char_sec_mode, char_sec_mode);
    to_radio_.setFixedLen(0);
    to_radio_.setMaxLen(meshtastic_ToRadio_size);
    to_radio_.setWriteCallback(onToRadioWrite, false);
    to_radio_.begin();

    from_radio_.setProperties(CHR_PROPS_READ);
    from_radio_.setPermission(char_sec_mode, SECMODE_NO_ACCESS);
    from_radio_.setFixedLen(0);
    from_radio_.setMaxLen(meshtastic_FromRadio_size);
    from_radio_.setReadAuthorizeCallback(onFromRadioAuthorize, false);
    from_radio_.begin();
    {
        uint8_t empty = 0;
        from_radio_.write(&empty, 0);
    }

    from_num_.setProperties(CHR_PROPS_NOTIFY | CHR_PROPS_READ);
    from_num_.setPermission(char_sec_mode, SECMODE_NO_ACCESS);
    from_num_.setFixedLen(4);
    from_num_.write32(0);
    from_num_.setCccdWriteCallback(onFromNumCccdWrite, false);
    from_num_.begin();

    log_radio_.setProperties(CHR_PROPS_NOTIFY | CHR_PROPS_READ);
    log_radio_.setPermission(char_sec_mode, SECMODE_NO_ACCESS);
    log_radio_.setFixedLen(0);
    log_radio_.setMaxLen(96);
    log_radio_.begin();
    bleLogBoth("[BLE][nrf52][mt] chars ready");
    bleLogBoth("[BLE][nrf52][mt][mem] svc=%p pop_scratch=%p buf=%p published=%p slots=%u to_radio=%p "
               "from_radio=%p from_num=%p phone=%p",
               static_cast<void*>(this),
               static_cast<void*>(&session_frame_scratch_),
               static_cast<void*>(session_frame_scratch_.buf),
               static_cast<void*>(published_from_radio_),
               static_cast<unsigned>(kPublishedFromRadioCapacity),
               static_cast<void*>(&to_radio_),
               static_cast<void*>(&from_radio_),
               static_cast<void*>(&from_num_),
               static_cast<void*>(phone_session_.get()));
    if (phone_session_)
    {
        phone_session_->debugLogMemoryLayout("ble_start");
    }
    probeGpsGuard("ble_start_after_chars");

    if (observer_bridge_)
    {
        observer_bridge_->registerObservers();
    }

    startPhoneAdvertising(true);
    active_ = true;
    pending_passkey_.store(0);
    syncMqttProxySettings();
    bleLogBoth("[BLE][nrf52][mt] service active");
    logFromRadioState("start_done");
}

void MeshtasticBleService::stop()
{
    if (observer_bridge_)
    {
        observer_bridge_->unregisterObservers();
    }

    disconnectAll();
    Bluefruit.Advertising.stop();
    flushPendingConfigSaves(true);
    if (phone_session_)
    {
        phone_session_->close();
    }
    active_ = false;
    connected_ = false;
    from_num_notify_enabled_ = false;
    conn_handle_ = BLE_CONN_HANDLE_INVALID;
    pending_passkey_.store(0);
    pending_to_radio_head_ = 0;
    pending_to_radio_tail_ = 0;
    pending_to_radio_count_ = 0;
    clearToPhoneQueue();
    pending_connect_log_ = false;
    pending_disconnect_log_ = false;
    pending_from_num_cccd_log_ = false;
    pending_pair_complete_log_ = false;
    pending_secured_log_ = false;
    pending_from_radio_auth_log_ = false;
    pending_from_radio_read_log_ = false;
    pending_from_radio_empty_log_ = false;
    clearPendingFromRadioReadAuthorize();
    pending_from_radio_auth_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    pending_from_radio_auth_offset_ = 0;
    pending_from_radio_auth_chr_ = 0;
    pending_from_radio_auth_svc_ = 0;
    pending_from_radio_empty_reason_ = 0;
    pending_from_radio_read_from_num_ = 0;
    pending_from_radio_read_due_ms_ = 0;
    pending_from_radio_read_len_ = 0;
    pending_disconnect_reason_ = 0;
    pairing_request_pending_ = false;
    pending_pairing_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    pending_phone_disconnect_request_ = false;
    directed_advertising_active_ = false;
    directed_advertising_attempted_ = false;
    directed_advertising_until_ms_ = 0;
    session_started_ms_ = 0;
    last_secured_ms_ = 0;
    last_from_num_cccd_ms_ = 0;
    last_to_radio_ms_ = 0;
    last_heartbeat_ms_ = 0;
    last_want_config_ms_ = 0;
    last_from_radio_read_ms_ = 0;
    last_from_num_notify_ms_ = 0;
    next_connected_session_log_ms_ = 0;
    next_ble_idle_log_ms_ = 0;
    next_liveness_log_ms_ = 0;
    if (s_active_service == this)
    {
        s_active_service = nullptr;
    }
}

void MeshtasticBleService::update()
{
    if (!active_)
    {
        return;
    }

    syncMqttProxySettings();

    if (phone_session_)
    {
        phone_session_->pumpIncomingAppData();
    }

    processPendingPairingRequest();
    processPendingToRadio();
    if (processPendingPhoneDisconnect())
    {
        return;
    }
    flushPendingFromRadioReadAuthorize();
    flushPendingFromNumNotify();
    logDeferredBleEvents();
    flushPendingConfigSaves(false);

    const uint32_t now_ms = millis();
    if (!connected_ && remembered_phone_peer_valid_ && !directed_advertising_attempted_)
    {
        startPhoneAdvertising(true);
    }

    if (directed_advertising_active_ && !connected_ &&
        static_cast<int32_t>(now_ms - directed_advertising_until_ms_) >= 0)
    {
        bleLogBoth("[BLE][nrf52][mt] directed advertising window elapsed; fallback to undirected");
        startPhoneAdvertising(false);
    }

    if (!Bluefruit.connected() && !Bluefruit.Advertising.isRunning())
    {
        startPhoneAdvertising(!directed_advertising_attempted_);
    }

    if (!connected_ && static_cast<int32_t>(now_ms - next_ble_idle_log_ms_) >= 0)
    {
        const ble_gap_addr_t own_addr = Bluefruit.getAddr();
        char own_addr_text[24] = {};
        formatBleAddress(own_addr, own_addr_text, sizeof(own_addr_text));
        char peer_addr_text[24] = {};
        if (remembered_phone_peer_valid_)
        {
            formatBleAddress(remembered_phone_peer_, peer_addr_text, sizeof(peer_addr_text));
        }
        bleLogBoth("[BLE][nrf52][mt] idle connected=%u adv=%u directed=%u directed_tried=%u own=%s type=%s peer=%s peer_type=%s peer_bonded=%u notify=%u cfg=%u send=%u name=%s",
                   connected_ ? 1U : 0U,
                   Bluefruit.Advertising.isRunning() ? 1U : 0U,
                   directed_advertising_active_ ? 1U : 0U,
                   directed_advertising_attempted_ ? 1U : 0U,
                   own_addr_text,
                   bleAddressTypeName(own_addr.addr_type),
                   remembered_phone_peer_valid_ ? peer_addr_text : "-",
                   remembered_phone_peer_valid_ ? bleAddressTypeName(remembered_phone_peer_.addr_type) : "-",
                   remembered_phone_peer_bonded_ ? 1U : 0U,
                   from_num_notify_enabled_ ? 1U : 0U,
                   phone_session_ && phone_session_->isConfigFlowActive() ? 1U : 0U,
                   phone_session_ && phone_session_->isSendingPackets() ? 1U : 0U,
                   device_name_.c_str());
        next_ble_idle_log_ms_ = now_ms + kBleIdleStateLogIntervalMs;
    }

    if (connected_ && static_cast<int32_t>(now_ms - next_connected_session_log_ms_) >= 0)
    {
        logSessionState("periodic");
        next_connected_session_log_ms_ = now_ms + kBleConnectedSessionLogIntervalMs;
    }
    checkPhoneSessionLiveness(now_ms);
}

void MeshtasticBleService::handleIncomingTextFromApp(const chat::MeshIncomingText& msg)
{
    if (!phone_session_ || !connected_)
    {
        bleLogBoth("[BLE][nrf52][mt] phone projection skip kind=text reason=not-connected from=%08lX id=%08lX",
                   static_cast<unsigned long>(msg.from),
                   static_cast<unsigned long>(msg.msg_id));
        return;
    }

