manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
void MeshtasticBleService::fillPublishedFromRadioSlots()
{
    if (!active_ || !connected_ || !phone_session_)
    {
        from_radio_publish_requested_ = false;
        return;
    }

    if (!from_radio_publish_requested_)
    {
        return;
    }

    const uint8_t target_capacity = phone_session_->isConfigFlowActive()
                                        ? kPublishedFromRadioCapacity
                                        : kSteadyPublishedFromRadioWindow;

    while (published_from_radio_count_ < target_capacity)
    {
        auto& session_frame = session_frame_scratch_;
        std::memset(&session_frame, 0, sizeof(session_frame));
        probeGpsGuard("ble_from_radio_pre_pop");
        if (!phone_session_->popToPhone(&session_frame))
        {
            probeGpsGuard("ble_from_radio_post_pop_empty");
            from_radio_publish_requested_ = false;
            return;
        }
        probeGpsGuard("ble_from_radio_post_pop_frame");

        if (session_frame.len == 0 || session_frame.len > meshtastic_FromRadio_size)
        {
            bleLogBoth("[BLE][nrf52][mt] drop invalid published from_radio frame from_num=%08lX len=%u max=%u kind=%s pri=%u",
                       static_cast<unsigned long>(session_frame.from_num),
                       static_cast<unsigned>(session_frame.len),
                       static_cast<unsigned>(meshtastic_FromRadio_size),
                       bleFrameKindName(session_frame.kind),
                       static_cast<unsigned>(session_frame.priority));
            continue;
        }

        const uint8_t slot_index = published_from_radio_tail_;
        PublishedFromRadioSlot& slot = published_from_radio_[slot_index];
        slot.frame = session_frame;
        slot.notified = false;
        bleLogBoth("[BLE][nrf52][mt][flow] publish slot=%u from_num=%08lX len=%u kind=%s pri=%u q=%u",
                   static_cast<unsigned>(slot_index),
                   static_cast<unsigned long>(slot.frame.from_num),
                   static_cast<unsigned>(slot.frame.len),
                   bleFrameKindName(slot.frame.kind),
                   static_cast<unsigned>(slot.frame.priority),
                   static_cast<unsigned>(published_from_radio_count_));

        noInterrupts();
        published_from_radio_tail_ =
            static_cast<uint8_t>((published_from_radio_tail_ + 1U) % kPublishedFromRadioCapacity);
        ++published_from_radio_count_;
        interrupts();
    }

    from_radio_publish_requested_ = true;
}

void MeshtasticBleService::flushPendingFromRadioReadAuthorize()
{
    if (!pending_from_radio_read_authorize_)
    {
        return;
    }

    fillPublishedFromRadioSlots();

    const uint16_t conn_handle = pending_from_radio_read_conn_handle_;
    if (conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        clearPendingFromRadioReadAuthorize();
        return;
    }

    const uint32_t now_ms = millis();
    if (published_from_radio_count_ > 0)
    {
        const bool consumed = writePublishedFromRadioForRead(conn_handle);
        authorizeRead(conn_handle);
        clearPendingFromRadioReadAuthorize();
        if (consumed)
        {
            last_from_radio_read_ms_ = now_ms;
            releasePublishedFromRadioHead();
        }
        return;
    }

    if (!active_ || !connected_ || static_cast<int32_t>(now_ms - pending_from_radio_read_due_ms_) >= 0)
    {
        writeEmptyFromRadioRead(active_ && connected_ ? kFromRadioEmptyNoFrame : kFromRadioEmptyInactive);
        authorizeRead(conn_handle);
        bleLogBoth("[BLE][nrf52][mt][flow] from_radio read wait timeout conn=%u active=%u connected=%u pending_to=%u publish_req=%u",
                   static_cast<unsigned>(conn_handle),
                   active_ ? 1U : 0U,
                   connected_ ? 1U : 0U,
                   static_cast<unsigned>(pending_to_radio_count_),
                   from_radio_publish_requested_ ? 1U : 0U);
        clearPendingFromRadioReadAuthorize();
    }
}

void MeshtasticBleService::clearPendingFromRadioReadAuthorize()
{
    pending_from_radio_read_authorize_ = false;
    pending_from_radio_read_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    pending_from_radio_read_due_ms_ = 0;
}

void MeshtasticBleService::writeEmptyFromRadioRead(uint8_t reason)
{
    uint8_t empty = 0;
    switch (reason)
    {
    case kFromRadioEmptyInactive:
        probeGpsGuard("ble_from_radio_pre_write_empty_inactive");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_inactive");
        break;
    case kFromRadioEmptyInvalidFrame:
        probeGpsGuard("ble_from_radio_pre_write_empty_invalid");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_invalid");
        break;
    case kFromRadioEmptyNoFrame:
    default:
        probeGpsGuard("ble_from_radio_pre_write_empty_no_frame");
        from_radio_.write(&empty, 0);
        probeGpsGuard("ble_from_radio_post_write_empty_no_frame");
        reason = kFromRadioEmptyNoFrame;
        break;
    }
    pending_from_radio_empty_log_ = true;
    pending_from_radio_empty_reason_ = reason;
}

bool MeshtasticBleService::writePublishedFromRadioForRead(uint16_t conn_handle)
{
    if (!active_ || !connected_ || !phone_session_)
    {
        writeEmptyFromRadioRead(kFromRadioEmptyInactive);
        return false;
    }

    if (published_from_radio_count_ == 0)
    {
        from_radio_publish_requested_ = true;
        writeEmptyFromRadioRead(kFromRadioEmptyNoFrame);
        return false;
    }

    const uint8_t slot_index = published_from_radio_head_;
    PublishedFromRadioSlot& slot = published_from_radio_[slot_index];
    if (slot.frame.len == 0 || slot.frame.len > meshtastic_FromRadio_size)
    {
        bleLogBoth("[BLE][nrf52][mt] drop invalid published from_radio read slot=%u from_num=%08lX len=%u max=%u kind=%s pri=%u",
                   static_cast<unsigned>(slot_index),
                   static_cast<unsigned long>(slot.frame.from_num),
                   static_cast<unsigned>(slot.frame.len),
                   static_cast<unsigned>(meshtastic_FromRadio_size),
                   bleFrameKindName(slot.frame.kind),
                   static_cast<unsigned>(slot.frame.priority));
        releasePublishedFromRadioHead();
        writeEmptyFromRadioRead(kFromRadioEmptyInvalidFrame);
        from_radio_publish_requested_ = true;
        return false;
    }

    probeGpsGuard("ble_from_radio_pre_write_frame");
    from_radio_.write(slot.frame.buf, slot.frame.len);
    probeGpsGuard("ble_from_radio_post_write_frame");
    pending_from_radio_read_len_ = static_cast<uint16_t>(slot.frame.len);
    pending_from_radio_read_from_num_ = slot.frame.from_num;
    pending_from_radio_read_log_ = true;
    bleLogBoth("[BLE][nrf52][mt][flow] from_radio read slot=%u from_num=%08lX len=%u kind=%s pri=%u",
               static_cast<unsigned>(slot_index),
               static_cast<unsigned long>(slot.frame.from_num),
               static_cast<unsigned>(slot.frame.len),
               bleFrameKindName(slot.frame.kind),
               static_cast<unsigned>(slot.frame.priority));
    (void)conn_handle;
    return true;
}

void MeshtasticBleService::releasePublishedFromRadioHead()
{
    if (published_from_radio_count_ == 0)
    {
        return;
    }

    PublishedFromRadioSlot& slot = published_from_radio_[published_from_radio_head_];
    slot.frame.len = 0;
    slot.frame.kind = phone::meshtastic::MeshtasticBleFrameKind::None;
    slot.frame.priority = phone::meshtastic::MeshtasticBleFramePriority::P3;
    slot.frame.from_num = 0;
    slot.notified = false;
    noInterrupts();
    published_from_radio_head_ =
        static_cast<uint8_t>((published_from_radio_head_ + 1U) % kPublishedFromRadioCapacity);
    --published_from_radio_count_;
    interrupts();
    from_radio_publish_requested_ = true;
}

bool MeshtasticBleService::enqueueToRadio(const uint8_t* data, size_t len)
{
    if (!data || len == 0 || len > meshtastic_ToRadio_size)
    {
        return false;
    }

    noInterrupts();
    if (pending_to_radio_count_ >= kPendingToRadioCapacity)
    {
        interrupts();
        Serial2.printf("[BLE][nrf52][mt] to_radio queue full len=%u\n", static_cast<unsigned>(len));
        return false;
    }

    PendingToRadioFrame& frame = pending_to_radio_[pending_to_radio_tail_];
    std::memcpy(frame.buf, data, len);
    frame.len = len;
    pending_to_radio_tail_ = static_cast<uint8_t>((pending_to_radio_tail_ + 1U) % kPendingToRadioCapacity);
    ++pending_to_radio_count_;
    interrupts();
    return true;
}

void MeshtasticBleService::processPendingToRadio()
{
    while (true)
    {
        noInterrupts();
        if (pending_to_radio_count_ == 0)
        {
            interrupts();
            return;
        }

        PendingToRadioFrame& frame = pending_to_radio_[pending_to_radio_head_];
        pending_to_radio_work_.len = frame.len;
        std::memcpy(pending_to_radio_work_.buf, frame.buf, frame.len);
        pending_to_radio_head_ = static_cast<uint8_t>((pending_to_radio_head_ + 1U) % kPendingToRadioCapacity);
        --pending_to_radio_count_;
        interrupts();

