manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
        (void)handleToRadio(pending_to_radio_work_.buf, pending_to_radio_work_.len);
    }
}

void MeshtasticBleService::processPendingPairingRequest()
{
    if (!pairing_request_pending_)
    {
        return;
    }

    const uint16_t conn_handle = pending_pairing_conn_handle_;
    pairing_request_pending_ = false;
    pending_pairing_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    requestPairingIfNeeded(conn_handle);
}

void MeshtasticBleService::clearToPhoneQueue()
{
    clearPendingFromRadioReadAuthorize();
    session_frame_scratch_ = phone::meshtastic::MeshtasticBleFrame{};
    for (uint8_t index = 0; index < kPublishedFromRadioCapacity; ++index)
    {
        published_from_radio_[index] = PublishedFromRadioSlot{};
    }
    published_from_radio_head_ = 0;
    published_from_radio_tail_ = 0;
    published_from_radio_count_ = 0;
    from_radio_publish_requested_ = false;
}

void MeshtasticBleService::loadRememberedPhonePeer()
{
    MeshtasticBlePeerIdentity stored{};
    bool from_bond_store = false;
    if (!loadMeshtasticBlePeerIdentity(&stored))
    {
        ble_gap_addr_t bonded_peer{};
        if (!loadFirstPeripheralBondPeer(&bonded_peer))
        {
            bleLogBoth("[BLE][nrf52][mt] remembered peer load none");
            return;
        }

        stored.addr_type = bonded_peer.addr_type;
        stored.bonded = 1;
        std::memcpy(stored.addr, bonded_peer.addr, sizeof(stored.addr));
        from_bond_store = true;
    }

    ble_gap_addr_t peer{};
    peer.addr_type = stored.addr_type;
    std::memcpy(peer.addr, stored.addr, sizeof(peer.addr));
    if (!isIdentityBleAddressType(peer.addr_type) || isEmptyBleAddress(peer))
    {
        char peer_addr_text[24] = {};
        formatBleAddress(peer, peer_addr_text, sizeof(peer_addr_text));
        bleLogBoth("[BLE][nrf52][mt] remembered peer ignored peer=%s type=%s(0x%02X)",
                   peer_addr_text,
                   bleAddressTypeName(peer.addr_type),
                   static_cast<unsigned>(peer.addr_type));
        return;
    }

    remembered_phone_peer_ = peer;
    remembered_phone_peer_valid_ = true;
    remembered_phone_peer_bonded_ = stored.bonded != 0;
    char peer_addr_text[24] = {};
    formatBleAddress(remembered_phone_peer_, peer_addr_text, sizeof(peer_addr_text));
    if (from_bond_store)
    {
        const bool saved = saveMeshtasticBlePeerIdentity(stored);
        bleLogBoth("[BLE][nrf52][mt] remembered peer persisted from bond saved=%u",
                   saved ? 1U : 0U);
    }
    bleLogBoth("[BLE][nrf52][mt] remembered peer loaded source=%s peer=%s type=%s(0x%02X) bonded=%u",
               from_bond_store ? "bond" : "settings",
               peer_addr_text,
               bleAddressTypeName(remembered_phone_peer_.addr_type),
               static_cast<unsigned>(remembered_phone_peer_.addr_type),
               remembered_phone_peer_bonded_ ? 1U : 0U);
}

void MeshtasticBleService::rememberPhonePeer(uint16_t conn_handle, const char* reason)
{
    BLEConnection* connection = Bluefruit.Connection(conn_handle);
    if (!connection)
    {
        bleLogBoth("[BLE][nrf52][mt] remember peer skipped reason=%s conn=%u unavailable",
                   reason ? reason : "?",
                   static_cast<unsigned>(conn_handle));
        return;
    }

    const ble_gap_addr_t peer = connection->getPeerAddr();
    char peer_addr_text[24] = {};
    formatBleAddress(peer, peer_addr_text, sizeof(peer_addr_text));
    if (!isIdentityBleAddressType(peer.addr_type) || isEmptyBleAddress(peer))
    {
        bleLogBoth("[BLE][nrf52][mt] remember peer skipped reason=%s peer=%s type=%s(0x%02X) bonded=%u secured=%u",
                   reason ? reason : "?",
                   peer_addr_text,
                   bleAddressTypeName(peer.addr_type),
                   static_cast<unsigned>(peer.addr_type),
                   connection->bonded() ? 1U : 0U,
                   connection->secured() ? 1U : 0U);
        return;
    }

    const bool bonded = connection->bonded();
    const bool unchanged = remembered_phone_peer_valid_ &&
                           remembered_phone_peer_.addr_type == peer.addr_type &&
                           std::memcmp(remembered_phone_peer_.addr, peer.addr, sizeof(peer.addr)) == 0 &&
                           remembered_phone_peer_bonded_ == bonded;

    remembered_phone_peer_ = peer;
    remembered_phone_peer_valid_ = true;
    remembered_phone_peer_bonded_ = bonded;
    if (unchanged)
    {
        bleLogBoth("[BLE][nrf52][mt] remembered peer unchanged reason=%s peer=%s type=%s(0x%02X) bonded=%u",
                   reason ? reason : "?",
                   peer_addr_text,
                   bleAddressTypeName(peer.addr_type),
                   static_cast<unsigned>(peer.addr_type),
                   bonded ? 1U : 0U);
        return;
    }

    MeshtasticBlePeerIdentity stored{};
    stored.addr_type = peer.addr_type;
    stored.bonded = bonded ? 1U : 0U;
    std::memcpy(stored.addr, peer.addr, sizeof(stored.addr));
    const bool saved = saveMeshtasticBlePeerIdentity(stored);
    bleLogBoth("[BLE][nrf52][mt] remembered peer saved=%u reason=%s peer=%s type=%s(0x%02X) bonded=%u secured=%u",
               saved ? 1U : 0U,
               reason ? reason : "?",
               peer_addr_text,
               bleAddressTypeName(peer.addr_type),
               static_cast<unsigned>(peer.addr_type),
               bonded ? 1U : 0U,
               connection->secured() ? 1U : 0U);
}

void MeshtasticBleService::startPhoneAdvertising(bool prefer_directed)
{
    const uint32_t now_ms = millis();
    if (prefer_directed && remembered_phone_peer_valid_ && !directed_advertising_attempted_)
    {
        directed_advertising_attempted_ = true;
        if (startAdvertising(service_, &remembered_phone_peer_))
        {
            directed_advertising_active_ = true;
            directed_advertising_until_ms_ = now_ms + kDirectedAdvertisingMs;
            return;
        }

        bleLogBoth("[BLE][nrf52][mt] directed advertising failed; fallback to undirected");
    }

    directed_advertising_active_ = false;
    directed_advertising_until_ms_ = 0;
    (void)startAdvertising(service_, nullptr);
}

void MeshtasticBleService::handleConnectEvent(uint16_t conn_handle)
{
    connected_ = true;
    conn_handle_ = conn_handle;
    ++ble_session_seq_;
    directed_advertising_active_ = false;
    directed_advertising_attempted_ = false;
    directed_advertising_until_ms_ = 0;
    last_ble_activity_ms_ = millis();
    session_started_ms_ = last_ble_activity_ms_;
    last_secured_ms_ = 0;
    last_from_num_cccd_ms_ = 0;
    last_to_radio_ms_ = 0;
    last_heartbeat_ms_ = 0;
    last_want_config_ms_ = 0;
    last_from_radio_read_ms_ = 0;
    last_from_num_notify_ms_ = 0;
    next_connected_session_log_ms_ = last_ble_activity_ms_ + kBleConnectedSessionLogIntervalMs;
    next_liveness_log_ms_ = 0;
    from_num_notify_enabled_ = false;
    pending_phone_disconnect_request_ = false;
    if (phone_session_)
    {
        phone_session_->close();
    }
    clearToPhoneQueue();
    pairing_request_pending_ = true;
    pending_pairing_conn_handle_ = conn_handle;
    pending_connect_conn_handle_ = conn_handle;
    pending_connect_log_ = true;

    char peer_addr_text[24] = {};
    BLEConnection* connection = Bluefruit.Connection(conn_handle);
    if (connection)
    {
        const ble_gap_addr_t peer_addr = connection->getPeerAddr();
        formatBleAddress(peer_addr, peer_addr_text, sizeof(peer_addr_text));
        bleLogBoth("[BLE][nrf52][mt][flow] link-up conn=%u adv=%u peer=%s type=%s(0x%02X) bonded=%u secured=%u mtu=%u interval=%u latency=%u timeout=%u",
                   static_cast<unsigned>(conn_handle),
                   Bluefruit.Advertising.isRunning() ? 1U : 0U,
                   peer_addr_text,
                   bleAddressTypeName(peer_addr.addr_type),
                   static_cast<unsigned>(peer_addr.addr_type),
                   connection->bonded() ? 1U : 0U,
                   connection->secured() ? 1U : 0U,
                   static_cast<unsigned>(connection->getMtu()),
                   static_cast<unsigned>(connection->getConnectionInterval()),
                   static_cast<unsigned>(connection->getSlaveLatency()),
                   static_cast<unsigned>(connection->getSupervisionTimeout()));
    }
    else
    {
        bleLogBoth("[BLE][nrf52][mt][flow] link-up conn=%u adv=%u peer=unavailable",
                   static_cast<unsigned>(conn_handle),
                   Bluefruit.Advertising.isRunning() ? 1U : 0U);
    }
    logSessionState("link_up");
    rememberPhonePeer(conn_handle, "connect");
}

void MeshtasticBleService::handleDisconnectEvent(uint16_t conn_handle, uint8_t reason)
{
    connected_ = false;
    from_num_notify_enabled_ = false;
    conn_handle_ = BLE_CONN_HANDLE_INVALID;
    last_ble_activity_ms_ = millis();
    next_connected_session_log_ms_ = 0;
    if (phone_session_)
    {
        phone_session_->close();
    }
    pending_passkey_.store(0);
    pending_to_radio_head_ = 0;
    pending_to_radio_tail_ = 0;
    pending_to_radio_count_ = 0;
    clearToPhoneQueue();
    pairing_request_pending_ = false;
    pending_pairing_conn_handle_ = BLE_CONN_HANDLE_INVALID;
    pending_disconnect_conn_handle_ = conn_handle;
    pending_disconnect_reason_ = reason;
    pending_disconnect_log_ = true;
    pending_phone_disconnect_request_ = false;
    next_liveness_log_ms_ = 0;
    directed_advertising_active_ = false;
    directed_advertising_attempted_ = false;
    directed_advertising_until_ms_ = 0;
    bleLogBoth("[BLE][nrf52][mt][flow] link-down conn=%u reason=0x%02X(%s) adv=%u",
               static_cast<unsigned>(conn_handle),
               static_cast<unsigned>(reason),
               disconnectReasonName(reason),
               Bluefruit.Advertising.isRunning() ? 1U : 0U);
    logSessionState("link_down", reason);
    flushPendingConfigSaves(true);
}

