manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/ble/meshtastic_ble.cpp
void MeshtasticBleService::handleFromNumCccdWrite(uint16_t conn_handle, uint16_t value)
{
    conn_handle_ = conn_handle;
    last_ble_activity_ms_ = millis();
    last_from_num_cccd_ms_ = last_ble_activity_ms_;
    from_num_notify_enabled_ = (value != 0U);
    pending_from_num_cccd_conn_handle_ = conn_handle;
    pending_from_num_cccd_value_ = value;
    pending_from_num_cccd_log_ = true;
    bleLogBoth("[BLE][nrf52][mt][flow] from_num subscribed=%u conn=%u value=0x%04X",
               from_num_notify_enabled_ ? 1U : 0U,
               static_cast<unsigned>(conn_handle),
               static_cast<unsigned>(value));
    logSessionState(from_num_notify_enabled_ ? "from_num_cccd_on" : "from_num_cccd_off", value);
}

void MeshtasticBleService::handlePairPasskeyDisplay(uint16_t conn_handle, const uint8_t passkey[6], bool match_request)
{
    const uint32_t parsed = parsePasskeyDigits(passkey);
    pending_passkey_.store(parsed);
    const uint32_t configured = configured_passkey_.load();
    bleLogBoth("[BLE][nrf52][mt][flow] passkey-display conn=%u passkey=%06lu configured=%06lu match=%u consistent=%u",
               static_cast<unsigned>(conn_handle),
               static_cast<unsigned long>(parsed),
               static_cast<unsigned long>(configured),
               match_request ? 1U : 0U,
               (configured == 0 || configured == parsed) ? 1U : 0U);
}

void MeshtasticBleService::handlePairComplete(uint16_t conn_handle, uint8_t auth_status)
{
    pending_passkey_.store(0);
    pending_pair_complete_conn_handle_ = conn_handle;
    pending_pair_complete_status_ = auth_status;
    pending_pair_complete_log_ = true;
    bleLogBoth("[BLE][nrf52][mt][flow] pair-complete conn=%u status=0x%02X(%s)",
               static_cast<unsigned>(conn_handle),
               static_cast<unsigned>(auth_status),
               gapSecurityStatusName(auth_status));
    if (auth_status == BLE_GAP_SEC_STATUS_SUCCESS)
    {
        rememberPhonePeer(conn_handle, "pair");
    }
}

void MeshtasticBleService::handleSecured(uint16_t conn_handle)
{
    pending_passkey_.store(0);
    pending_secured_conn_handle_ = conn_handle;
    pending_secured_log_ = true;
    last_secured_ms_ = millis();
    BLEConnection* connection = Bluefruit.Connection(conn_handle);
    bleLogBoth("[BLE][nrf52][mt][flow] secured conn=%u bonded=%u secured=%u mtu=%u",
               static_cast<unsigned>(conn_handle),
               connection && connection->bonded() ? 1U : 0U,
               connection && connection->secured() ? 1U : 0U,
               connection ? static_cast<unsigned>(connection->getMtu()) : 0U);
    logSessionState("secured");
    rememberPhonePeer(conn_handle, "secured");
}

bool MeshtasticBleService::getPairingStatus(BlePairingStatus* out) const
{
    if (!out)
    {
        return false;
    }

    *out = BlePairingStatus{};
    out->available = phone_facade_.isBleEnabled();
    out->requires_passkey = ble_config_.mode != meshtastic_Config_BluetoothConfig_PairingMode_NO_PIN;
    out->is_fixed_pin = ble_config_.mode == meshtastic_Config_BluetoothConfig_PairingMode_FIXED_PIN;
    out->is_connected = isBleConnected();
    out->passkey = effectivePasskey();
    out->is_pairing_active = out->requires_passkey && out->passkey != 0;
    return true;
}

bool MeshtasticBleService::isBleConnected() const
{
    return connected_ && Bluefruit.connected();
}

bool MeshtasticBleService::isPhoneBleConnected() const
{
    return isBleConnected();
}

uint32_t MeshtasticBleService::pendingPhoneBlePasskey() const
{
    return effectivePasskey();
}

void MeshtasticBleService::requestPhoneHighThroughputConnection()
{
}

void MeshtasticBleService::requestPhoneLowerPowerConnection()
{
}

void MeshtasticBleService::requestPhoneDisconnect()
{
    pending_phone_disconnect_request_ = true;
}

bool MeshtasticBleService::processPendingPhoneDisconnect()
{
    if (!pending_phone_disconnect_request_)
    {
        return false;
    }

    pending_phone_disconnect_request_ = false;
    const uint16_t handle = conn_handle_;
    const bool handle_valid = handle != BLE_CONN_HANDLE_INVALID;
    const bool gap_connected = handle_valid && Bluefruit.connected(handle);
    bleLogBoth("[BLE][nrf52][mt][flow] phone disconnect request connected=%u gap=%u handle=%u",
               connected_ ? 1U : 0U,
               gap_connected ? 1U : 0U,
               handle_valid ? static_cast<unsigned>(handle) : 0xFFFFU);

    clearPendingFromRadioReadAuthorize();
    pending_to_radio_head_ = 0;
    pending_to_radio_tail_ = 0;
    pending_to_radio_count_ = 0;
    clearToPhoneQueue();
    from_num_notify_enabled_ = false;
    pending_passkey_.store(0);

    if (!connected_ || !gap_connected)
    {
        if (!Bluefruit.Advertising.isRunning())
        {
            startPhoneAdvertising(!directed_advertising_attempted_);
        }
        return false;
    }

    const bool ok = Bluefruit.disconnect(handle);
    bleLogBoth("[BLE][nrf52][mt][flow] phone disconnect gap_request handle=%u ok=%u",
               static_cast<unsigned>(handle),
               ok ? 1U : 0U);
    if (!ok)
    {
        pending_phone_disconnect_request_ = true;
    }
    return true;
}

void MeshtasticBleService::checkPhoneSessionLiveness(uint32_t now_ms)
{
    if (!active_ || !connected_ || conn_handle_ == BLE_CONN_HANDLE_INVALID)
    {
        return;
    }

    uint32_t last_phone_activity_ms = last_ble_activity_ms_;
    if (last_heartbeat_ms_ > last_phone_activity_ms)
    {
        last_phone_activity_ms = last_heartbeat_ms_;
    }
    if (last_from_radio_read_ms_ > last_phone_activity_ms)
    {
        last_phone_activity_ms = last_from_radio_read_ms_;
    }
    if (last_to_radio_ms_ > last_phone_activity_ms)
    {
        last_phone_activity_ms = last_to_radio_ms_;
    }

    if (last_phone_activity_ms == 0 ||
        static_cast<uint32_t>(now_ms - last_phone_activity_ms) < kPhoneSessionStaleMs)
    {
        return;
    }

    if (next_liveness_log_ms_ == 0 || static_cast<int32_t>(now_ms - next_liveness_log_ms_) >= 0)
    {
        bleLogBoth("[BLE][nrf52][mt][flow] phone session stale age_ms=%lu limit_ms=%lu connected=%u gap=%u "
                   "notify=%u cfg=%u send=%u",
                   static_cast<unsigned long>(now_ms - last_phone_activity_ms),
                   static_cast<unsigned long>(kPhoneSessionStaleMs),
                   connected_ ? 1U : 0U,
                   Bluefruit.connected(conn_handle_) ? 1U : 0U,
                   from_num_notify_enabled_ ? 1U : 0U,
                   (phone_session_ && phone_session_->isConfigFlowActive()) ? 1U : 0U,
                   (phone_session_ && phone_session_->isSendingPackets()) ? 1U : 0U);
        next_liveness_log_ms_ = now_ms + kPhoneSessionStaleLogIntervalMs;
    }

    pending_phone_disconnect_request_ = true;
    (void)processPendingPhoneDisconnect();
}

void MeshtasticBleService::onPhoneBluetoothConfigChanged()
{
    markConfigSavePending(true, false);
    bleLogBoth("[BLE][nrf52][mt] saveBluetoothConfig requested mode=%u pin=%06lu enabled=%u",
               static_cast<unsigned>(ble_config_.mode),
               static_cast<unsigned long>(ble_config_.fixed_pin),
               ble_config_.enabled ? 1U : 0U);
    flushPendingConfigSaves(true);
}

void MeshtasticBleService::onPhoneModuleConfigChanged()
{
    markConfigSavePending(false, true);
    syncMqttProxySettings();
    bleLogBoth("[BLE][nrf52][mt] saveModuleConfig requested");
    flushPendingConfigSaves(true);
}

void MeshtasticBleService::notifyFromNum(uint32_t from_num)
{
    if (!active_ || !connected_ || !phone_session_)
    {
        bleLogBoth("[BLE][nrf52][mt][flow] from_radio publish request source=%08lX skip inactive active=%u connected=%u",
                   static_cast<unsigned long>(from_num),
                   active_ ? 1U : 0U,
                   connected_ ? 1U : 0U);
        return;
    }

